#!/bin/bash
echo ---------------------------------------------------------------------------------------------------------
echo "for循环"
for test in 1 2 3 4 5
do
    echo $test
done
echo 修改字段分隔符
IFS=$'\n'

# 用通配符读取目录
for file in /home/*
do
    echo $file
done

for ((i = 0; i < 10; i++))
do
    echo $i
done

echo ---------------------------------------------------------------------------------------------------------
echo "while循环"
var1=10
while [ $var1 -gt 0 ]
do
 echo $var1
done

echo ---------------------------------------------------------------------------------------------------------
echo "until循环"
var1=10
until [ $var1 -gt 0 ]
do
    echo $var1
done

echo ---------------------------------------------------------------------------------------------------------
echo break 命令
for test in 1 2 3 4 5
do
    if [ $test -eq 3 ]
    then
    break
    fi
done





















