#!/bin/bash

echo ---------------------------------------------------------------------------------------------------------
echo "命令行参数"
echo 位置参数变量是标准的数字：$0是程序名，$1是第一个参数，$2是第二个参数，依此类推。
echo $@ 获取所有参数
echo $* 获取所有参数
echo $# 获取参数个数
echo $? 获取上一个命令的返回值
echo $$ 获取当前进程的进程号
echo $! 获取最后一个后台进程的进程号
for (( number = 1; number <= $1; number++ ))
do
    echo $number
done

echo ---------------------------------------------------------------------------------------------------------
echo "移动变量"
count=1
while [ -n "$1"]
do
    count=$[ $count + 1 ]
    shift
done

