#!/bin/bash
echo ---------------------------------------------------------------------------------------------------------
echo 标准输入 STDIN
cat < /home/test.txt

echo ---------------------------------------------------------------------------------------------------------
echo 标准输出 STDOUT
cat > /home/test.txt

echo ---------------------------------------------------------------------------------------------------------
echo 标准错误 STDERR

echo 重定向错误
ls -al badfile 2> /home/test.txt

echo 重定向错误和数据
ls -al test test2 2> test.txt 1> test2.txt
ls -al test test2 &> test.txt

