#!/bin/bash
echo ---------------------------------------------------------------------------------------------------------
echo 用户变量,变量和等号和值之间不能出现空格
var1=10
var2="still more testing"
echo $var1,$var2

echo ---------------------------------------------------------------------------------------------------------
echo 把输出赋值给变量
testing=`date`
testing2=$(date)
echo $testing,$testing2

echo ---------------------------------------------------------------------------------------------------------
# 通过命令替换获得当前日期
today=$(date +%y%m%d)
echo $today

echo ---------------------------------------------------------------------------------------------------------
echo 重定向
echo 输出重定向
date > date.txt
date >> date.txt # 追加
echo 输入重定向
wc < test.txt

echo ---------------------------------------------------------------------------------------------------------
echo 数学运算
expr 1 + 5
expr 5 \* 2
var1=$[1 + 5]
echo $var1
var2=$[$var1 * 3]
echo $var2
echo 浮点数
var1=$(echo "scale=2; 1.5 * 3" | bc)
echo $var1

echo ---------------------------------------------------------------------------------------------------------
echo 查看脚本退出状态码
echo $?
# 指定退出状态码
# exit 5




























