#!/bin/bash
echo 处理信号

echo ---------------------------------------------------------------------------------------------------------
echo 生成信号
echo 中断信号，Ctrl+C组合键发送SIGINT信号
echo 暂停进程，Ctrl+Z组合键发送SIGTSTP信号

echo ---------------------------------------------------------------------------------------------------------
echo 捕获脚本退出
trap 'echo "trap: $BASH_COMMAND"' EXIT

# 以后台模式运行脚本 ./test4.sh &

echo ---------------------------------------------------------------------------------------------------------
echo 运行多个后台作业
echo "使用nohup命令运行脚本"






















